# Left Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TableMergedCell..::..Left Property
TableMergedCell Class See Also
---
Specifies the column index of the top-left corner of a table grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public int Left { get; set; }
```

Visual Basic
---
```text
Public Property Left As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Left {
	int get ();
	void set (int value);
}
```

# See Also
TableMergedCell Class
Autodesk.Revit.DB Namespace